app/tests/load/api-load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"
    - duration: 60
      arrivalRate: 20
      name: "Spike test"
  processor: "./tests/load/processor.js"

scenarios:
  - name: "GET all escape rooms"
    flow:
      - get:
          url: "/api/escape-room"
          capture:
            - json: "$[0].id"
              as: "roomId"

  - name: "Create and fetch escape room"
    flow:
      - post:
          url: "/api/escape-room"
          json:
            title: "Load Test Room {{ $randomString() }}"
            htmlContent: "Test content"
            timeSpent: 300
            stagesCompleted: 3
          capture:
            - json: "$.id"
              as: "newRoomId"
      - get:
          url: "/api/escape-room/{{ newRoomId }}"

  - name: "Update escape room"
    flow:
      - post:
          url: "/api/escape-room"
          json:
            title: "Room to Update"
            htmlContent: "Original"
            timeSpent: 100
            stagesCompleted: 1
          capture:
            - json: "$.id"
              as: "updateRoomId"
      - put:
          url: "/api/escape-room/{{ updateRoomId }}"
          json:
            title: "Updated Room"
            htmlContent: "Updated"
            timeSpent: 500
            stagesCompleted: 5